Pandas--DataFrame and Series

data cleaning,analysis,two primary data structures :
1.Series(1-D array like object) 
2.DataFrame(2-D,size mutable, potentially heterogeneous tabular data structure with labeled axes)

In [1]:
import pandas as pd

In [2]:
##Series
#similar to a column in a table
import pandas as pd
data = [1,2,3,4,5 ]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
#series from dictionary
data_dict = {'a': 1, 'b': 2, 'c': 3}
series_dict = pd.Series(data_dict)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data = [10,20,30]
index = ['a', 'b', 'c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [15]:
# DataFrame
# create a dataframe from a dictionary
data = {    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [9]:
import numpy as np
np.array(df)

array([['Alice', 25, 'New York'],
       ['Bob', 30, 'Los Angeles'],
       ['Charlie', 35, 'Chicago']], dtype=object)

In [10]:
#Create a dataframe from a list of dictionaries
data_list = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'}
]
df_from_list = pd.DataFrame(data_list)
print(df_from_list)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [46]:
df_sales = pd.read_csv('sales_data.csv')
df_sales.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [47]:
df_sales.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [13]:
#accessing data from dataframe
data

{'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 30, 35],
 'City': ['New York', 'Los Angeles', 'Chicago']}

In [16]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [18]:
df['Name']
type(df['Name'])

pandas.core.series.Series

In [22]:
df.loc[0]  # Accessing the first row

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [23]:
df.iloc[0]  # Accessing the first row using integer location

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [24]:
df.loc[0][0]

C:\Users\himan\AppData\Local\Temp\ipykernel_16512\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Alice'

In [27]:
df.iloc[1][1]

C:\Users\himan\AppData\Local\Temp\ipykernel_16512\1723490747.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][1]

30

In [29]:
#accessing a specified  element
df.at[1,'City']

'Los Angeles'

In [31]:
df.iat[2,2]

'Chicago'

In [32]:
#Data manipulation with dataframes
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [41]:
df['Salary'] = [50000, 60000, 70000]  # Adding a new column
df

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [42]:
df.drop('Salary', axis=1)#default axis is 0 which is for rows, axis =1 checks for columns

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [43]:
df

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [44]:
df.drop('Salary', axis=1, inplace=True)  # Dropping a column permanently
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [45]:
## add age to the column
df['Age'] = df['Age']+1
df

      Name  Age         City
0    Alice   26     New York
1      Bob   31  Los Angeles
2  Charlie   36      Chicago

In [49]:
df_sales.dtypes #datatypes of each column

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [51]:
df_sales.describe()  # Summary statistics of numerical columns

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [55]:
##handling missing values
df_sales[df_sales.isnull()]

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
235,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
236,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
237,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
238,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
239,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [58]:
df_sales.isnull().any(axis = 1)

0      False
1      False
2      False
3      False
4      False
       ...
235    False
236    False
237    False
238    False
239    False
Length: 240, dtype: bool

In [59]:
df_sales.isnull().any()

Transaction ID      False
Date                False
Product Category    False
Product Name        False
Units Sold          False
Unit Price          False
Total Revenue       False
Region              False
Payment Method      False
dtype: bool

In [65]:
df_sales.isnull().sum()

Transaction ID      0
Date                0
Product Category    0
Product Name        0
Units Sold          0
Unit Price          0
Total Revenue       0
Region              0
Payment Method      0
dtype: int64

In [66]:
df_filled = df_sales.fillna(0)  # Filling missing values with 0

In [70]:
#filling with mean
df_sales['UnitSold_fillNA'] = df_sales['Units Sold'].fillna(df_sales['Units Sold'].mean())

In [71]:
df_sales.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
UnitSold_fillNA       int64
dtype: object

In [74]:
#rename columns
df_sales = df_sales.rename(columns = {'Date' : 'Sale Date'})
df_sales.head(2)

,Transaction ID,Sale Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method,UnitSold_fillNA
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card,2
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal,1

In [ ]:
#change datatypes
df_sales['Unit_Price'] = df_sales['Unit Price'].astype(int)

In [77]:
df_sales.head(2)

,Transaction ID,Sale Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method,UnitSold_fillNA,Unit_Price
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card,2,999
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal,1,499

In [78]:
df_sales['New Price'] = df_sales['Unit Price'].apply(lambda x: x * 1.1)  # Applying a function to a column

In [80]:
df_sales.head(2)

,Transaction ID,Sale Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method,UnitSold_fillNA,Unit_Price,New Price
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card,2,999,1099.989
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal,1,499,549.989

In [81]:
#Data Aggrefation and Grouping
grouped_mean = df_sales.groupby('Product Name')['Unit Price'].mean()
print(grouped_mean)

Product Name
1984 by George Orwell                                  19.99
Adidas 3-Stripes Shorts                                29.99
Adidas Essential Track Pants                           44.99
Adidas FIFA World Cup Football                         29.99
Adidas Originals Superstar Sneakers                    79.99
                                                       ...
Yeti Tundra Haul Portable Wheeled Cooler              399.99
Youth to the People Superfood Antioxidant Cleanser     36.00
Zara Summer Dress                                      59.99
iPhone 14 Pro                                         999.99
iRobot Braava Jet M6                                  449.99
Name: Unit Price, Length: 232, dtype: float64

In [82]:
grouped_sum = df_sales.groupby(['Product Name', 'Region'])['Unit Price'].sum()  # Grouping by multiple columns and calculating sum
print(grouped_sum)

Product Name                                        Region
1984 by George Orwell                               North America     19.99
Adidas 3-Stripes Shorts                             Asia              29.99
Adidas Essential Track Pants                        Asia              44.99
Adidas FIFA World Cup Football                      Asia              29.99
Adidas Originals Superstar Sneakers                 Asia              79.99
                                                                      ...
Yeti Tundra Haul Portable Wheeled Cooler            Asia             399.99
Youth to the People Superfood Antioxidant Cleanser  Europe            36.00
Zara Summer Dress                                   Asia              59.99
iPhone 14 Pro                                       North America    999.99
iRobot Braava Jet M6                                Europe           449.99
Name: Unit Price, Length: 233, dtype: float64

In [85]:
#aggregate multiple functions
grouped_agg = df_sales.groupby('Region')['Unit_Price'].agg(['mean', 'sum', 'count']) 
print(grouped_agg)

                  mean    sum  count
Region
Asia           163.525  13082     80
Europe         190.300  15224     80
North America  352.975  28238     80

In [86]:
#Merging and joining dataframes
df1 = pd.DataFrame({'Key': ['A', 'B', 'C'], 'Value1': [1, 2, 3]})
df2 = pd.DataFrame({'Key': ['A', 'B', 'D'], 'Value2': [4, 5, 6]})

In [87]:
df1

  Key  Value1
0   A       1
1   B       2
2   C       3

In [88]:
df2

  Key  Value2
0   A       4
1   B       5
2   D       6

In [89]:
#Merge Dataframes on the Key column
pd.merge(df1, df2, on='Key', how='inner')  # Inner join on 'Key' column

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [90]:
pd.merge(df1, df2, on='Key', how='outer')  # Outer join on 'Key' column

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [91]:
pd.merge(df1, df2, on='Key', how='left')  # Left join on 'Key' column

  Key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [92]:
pd.merge(df1, df2, on='Key', how='right')  # Right join on 'Key' column

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6